{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FQuickBakerCore",
			"Children": [
				{
					"Source":
					{
						"Text": "Bake Texture"
					},
					"Translation":
					{
						"Text": "Bake Texture"
					},
					"Key": "BakeTextureTransaction"
				},
				{
					"Source":
					{
						"Text": "Baking Texture..."
					},
					"Translation":
					{
						"Text": "Baking Texture..."
					},
					"Key": "BakingTexture"
				},
				{
					"Source":
					{
						"Text": "Failed to create output directory."
					},
					"Translation":
					{
						"Text": "Failed to create output directory."
					},
					"Key": "Error_MakeDirectory"
				},
				{
					"Source":
					{
						"Text": "Failed to create render target."
					},
					"Translation":
					{
						"Text": "Failed to create render target."
					},
					"Key": "Error_RTCreate"
				},
				{
					"Source":
					{
						"Text": "Failed to create texture from render target."
					},
					"Translation":
					{
						"Text": "Failed to create texture from render target."
					},
					"Key": "Error_BakeFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to save file to disk or convert image."
					},
					"Translation":
					{
						"Text": "Failed to save file to disk or convert image."
					},
					"Key": "Error_SaveFile"
				},
				{
					"Source":
					{
						"Text": "No valid editor world found."
					},
					"Translation":
					{
						"Text": "No valid editor world found."
					},
					"Key": "Error_NoWorld"
				},
				{
					"Source":
					{
						"Text": "Rendering Material..."
					},
					"Translation":
					{
						"Text": "Rendering Material..."
					},
					"Key": "Rendering"
				},
				{
					"Source":
					{
						"Text": "Saved to {0}"
					},
					"Translation":
					{
						"Text": "Saved to {0}"
					},
					"Key": "Success_Export"
				},
				{
					"Source":
					{
						"Text": "Saving..."
					},
					"Translation":
					{
						"Text": "Saving..."
					},
					"Key": "Saving"
				},
				{
					"Source":
					{
						"Text": "Setting up Render Target..."
					},
					"Translation":
					{
						"Text": "Setting up Render Target..."
					},
					"Key": "SetupRT"
				},
				{
					"Source":
					{
						"Text": "Texture baked successfully!"
					},
					"Translation":
					{
						"Text": "Texture baked successfully!"
					},
					"Key": "Success_Bake"
				}
			]
		},
		{
			"Namespace": "FQuickBakerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Open Quick Baker with this material"
					},
					"Translation":
					{
						"Text": "Open Quick Baker with this material"
					},
					"Key": "QuickBakerContextTooltip"
				},
				{
					"Source":
					{
						"Text": "Opens the Quick Baker window"
					},
					"Translation":
					{
						"Text": "Opens the Quick Baker window"
					},
					"Key": "QuickBakerTooltip"
				},
				{
					"Source":
					{
						"Text": "Quick Baker"
					},
					"Translation":
					{
						"Text": "Quick Baker"
					},
					"Key": "QuickBakerContextCommand"
				},
				{
					"Source":
					{
						"Text": "Quick Baker"
					},
					"Translation":
					{
						"Text": "Quick Baker"
					},
					"Key": "QuickBakerCommand"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerLabel"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerTabTitle"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerContextLabel"
				}
			]
		},
		{
			"Namespace": "SQuickBakerWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Bake Texture"
					},
					"Translation":
					{
						"Text": "Bake Texture"
					},
					"Key": "BakeTexture"
				},
				{
					"Source":
					{
						"Text": "Bit Depth"
					},
					"Translation":
					{
						"Text": "Bit Depth"
					},
					"Key": "Label_BitDepth"
				},
				{
					"Source":
					{
						"Text": "Browse"
					},
					"Translation":
					{
						"Text": "Browse"
					},
					"Key": "Browse"
				},
				{
					"Source":
					{
						"Text": "Choose between 8-bit and 16-bit. 16-bit is highly recommended for Noise and SDF to avoid banding."
					},
					"Translation":
					{
						"Text": "Choose between 8-bit and 16-bit. 16-bit is highly recommended for Noise and SDF to avoid banding."
					},
					"Key": "Tooltip_BitDepth"
				},
				{
					"Source":
					{
						"Text": "Compression"
					},
					"Translation":
					{
						"Text": "Compression"
					},
					"Key": "Label_Compression"
				},
				{
					"Source":
					{
						"Text": "Invalid bake settings."
					},
					"Translation":
					{
						"Text": "Invalid bake settings."
					},
					"Key": "Error_InvalidSettings"
				},
				{
					"Source":
					{
						"Text": "Material"
					},
					"Translation":
					{
						"Text": "Material"
					},
					"Key": "Label_Material"
				},
				{
					"Source":
					{
						"Text": "Open the Asset Picker or Folder Dialog to select a destination folder."
					},
					"Translation":
					{
						"Text": "Open the Asset Picker or Folder Dialog to select a destination folder."
					},
					"Key": "Tooltip_Browse"
				},
				{
					"Source":
					{
						"Text": "Output Name"
					},
					"Translation":
					{
						"Text": "Output Name"
					},
					"Key": "Label_OutputName"
				},
				{
					"Source":
					{
						"Text": "Output Path"
					},
					"Translation":
					{
						"Text": "Output Path"
					},
					"Key": "Label_OutputPath"
				},
				{
					"Source":
					{
						"Text": "Output Type"
					},
					"Translation":
					{
						"Text": "Output Type"
					},
					"Key": "Label_OutputType"
				},
				{
					"Source":
					{
						"Text": "Please select a material to bake."
					},
					"Translation":
					{
						"Text": "Please select a material to bake."
					},
					"Key": "Error_NoMaterial"
				},
				{
					"Source":
					{
						"Text": "Please specify an output name."
					},
					"Translation":
					{
						"Text": "Please specify an output name."
					},
					"Key": "Error_NoName"
				},
				{
					"Source":
					{
						"Text": "Resolution"
					},
					"Translation":
					{
						"Text": "Resolution"
					},
					"Key": "Label_Resolution"
				},
				{
					"Source":
					{
						"Text": "Save Texture"
					},
					"Translation":
					{
						"Text": "Save Texture"
					},
					"Key": "SaveTextureDialog"
				},
				{
					"Source":
					{
						"Text": "Select Output Folder"
					},
					"Translation":
					{
						"Text": "Select Output Folder"
					},
					"Key": "SelectFolder"
				},
				{
					"Source":
					{
						"Text": "Select the Material or Material Instance to bake. The 'Final Color' (Emissive) will be captured."
					},
					"Translation":
					{
						"Text": "Select the Material or Material Instance to bake. The 'Final Color' (Emissive) will be captured."
					},
					"Key": "Tooltip_Material"
				},
				{
					"Source":
					{
						"Text": "Select the compression format for the resulting texture. TC_Default is standard for most cases."
					},
					"Translation":
					{
						"Text": "Select the compression format for the resulting texture. TC_Default is standard for most cases."
					},
					"Key": "Tooltip_Compression"
				},
				{
					"Source":
					{
						"Text": "Select the output format: Asset, PNG, or EXR."
					},
					"Translation":
					{
						"Text": "Select the output format: Asset, PNG, or EXR."
					},
					"Key": "Tooltip_OutputType"
				},
				{
					"Source":
					{
						"Text": "Set the width and height of the output texture. Higher values provide more detail but use more memory."
					},
					"Translation":
					{
						"Text": "Set the width and height of the output texture. Higher values provide more detail but use more memory."
					},
					"Key": "Tooltip_Resolution"
				},
				{
					"Source":
					{
						"Text": "Start the baking process. This will render the material to a temporary Render Target and save it as a Static Texture or File."
					},
					"Translation":
					{
						"Text": "Start the baking process. This will render the material to a temporary Render Target and save it as a Static Texture or File."
					},
					"Key": "Tooltip_Bake"
				},
				{
					"Source":
					{
						"Text": "The destination folder in the Content Browser or on disk."
					},
					"Translation":
					{
						"Text": "The destination folder in the Content Browser or on disk."
					},
					"Key": "Tooltip_OutputPath"
				},
				{
					"Source":
					{
						"Text": "The name of the generated Texture asset. Automatically prefixed with T_ based on naming conventions."
					},
					"Translation":
					{
						"Text": "The name of the generated Texture asset. Automatically prefixed with T_ based on naming conventions."
					},
					"Key": "Tooltip_OutputName"
				},
				{
					"Source":
					{
						"Text": "Tip: Use Unlit materials or ensure Emissive (Final Color) is connected."
					},
					"Translation":
					{
						"Text": "Tip: Use Unlit materials or ensure Emissive (Final Color) is connected."
					},
					"Key": "MaterialHint"
				},
				{
					"Source":
					{
						"Text": "⚠️ This material is not Unlit. Ensure Emissive (Final Color) is connected."
					},
					"Translation":
					{
						"Text": "⚠️ This material is not Unlit. Ensure Emissive (Final Color) is connected."
					},
					"Key": "MaterialWarning"
				}
			]
		}
	]
}